// ROOT --- 并行1 --- 任务1 --- 执行1/并行4 --- 任务4 --- 执行4/并行 --- ...
//       |             |                       |
//       |             |                      并行7 --- 任务7 --- ...
//       |             |
//       |            并行3 --- 任务3 --- 执行3/并行4 --- 任务4 --- ...
//       |                       |
//       |                      并行6 --- 任务6 --- ...
//       |
// ROOT --- 并行2 --- 任务2 --- 执行2/并行5 --- 任务5 --- ...

export type ParallelContext = {
  /**
   * 当前任务在本机的并行索引
   * - 起始索引为 1
   */
  index: number;
  /**
   * 尝试触发下一个并行任务执行
   */
  tryNextTask: () => Promise<void>;
};
